backend/load-test.yml
# To run this load test, you must generate a valid JWT token from the /api/auth/login endpoint.
# Then, pass it using an environment variable like so:
# TOKEN="your-jwt-token" npx artillery run load-test.yml

config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Sustained load"
  engines:
    socketio: {}

scenarios:
  - name: "Socket.io message sending"
    engine: "socketio"
    flow:
      - connect:
          auth:
            token: "{{ $processEnvironment.TOKEN }}"
      - emit:
          channel: "send_message"
          data:
            clientTempId: "temp-uuid-{{ $randomString() }}"
            receiverId: 2
            message: "Hello from artillery {{ $randomString() }}"
      - think: 1